workstation/tutorials/incompressible/pisoFoam/RAS/cavity/system/FOs/FOstreamFunction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

streamFunction1
{
    // Mandatory entries
    type            streamFunction;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    field           phi;
    result          streamFunc;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0.1;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 5;
    writeControl    writeTime;
    writeInterval   -1;
}


// ************************************************************************* //
